jmharvey1/ESP32S3_CW_Machine/src/main.cpp
/*
 Note 1: parts of the BT-Keyboard code (bt_keyboard.cpp) was based on source code with the same file name &
   Copyright (c) 2020 by Guy Turcotte
  see MIT License. Look at file licenses.txt for details.
  Note 2: for IDF 5.2 keneral code, i2c_master.c has been modified, at function 'i2c_master_transmit_receive()',
  after line 'ESP_RETURN_ON_ERROR(s_i2c_asynchronous_transaction(i2c_dev, i2c_ops, DIM(i2c_ops), xfer_timeout_ms), TAG, "I2C transaction failed");'
  added this entry: 'vTaskDelay(2);'
  This stopped random crashes related to gt911 touch procssing.
  Also added this statement, two places, in the same file, 
  free(i2c_dev->master_bus->anyc_write_buffer[i2c_dev->master_bus->index]);
  at lines 984, & 1023.

  Note 2: Update LVGLMsgBox.h file to get the REV DAtE to update on the Main Screen's title line.
*/
/*Note 3: When creating a new lvgl/WaveShare LCD/ESP32s3 project, to run menuconfig, & set the following settings:
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y [should align with PSRAM]
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y and CONFIG_SPIRAM_SPEED_120M=y [should align with PSRAM]
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
#The following LVGL configuration can improve the frame rate (LVGL v8.3):
#define LV_MEM_CUSTOM 1 or CONFIG_LV_MEM_CUSTOM=y
#define LV_MEMCPY_MEMSET_STD 1 or CONFIG_LV_MEMCPY_MEMSET_STD=y
#define LV_ATTRIBUTE_FAST_MEM IRAM_ATTR or CONFIG_LV_ATTRIBUTE_FAST_MEM=y
*/
/*initially had an issue wid stack overflow with  "A stack overflow in task esp_ble_hidh_ev".
went to: esp-idf/components/esp_hid/src/ble_hidd.c line 974
and found code that looked like this:
esp_event_loop_args_t event_task_args = {
        .queue_size = 5,
        .task_name = "ble_hidd_events",
        .task_priority = uxTaskPriorityGet(NULL),
        .task_stack_size = 2048,
        .task_core_id = tskNO_AFFINITY
    };
 changed .task_stack_size = 5120, 
 Correction 20240829
 think the real place to set the task stack size is in
 the "bool BTKeyboard::setup(pid_handler *handler, BTKeyboard *KBptr)"
 method, found in, 'bt_keyboard.cpp'  
*/
/*20240729 Fully functional but needs refinement*/
/*20240822 Now support Keyboard battery state, but subject to crashing when running app tries to connect to keyboard a 2nd time*/
/*20240828 Added BIAS auto-correction to ADC sampling */
/*20240828 Moved modified i2c_master.c file plus support .h file to local project lib directory*/
/*20240828 Moved CW Key output from UART TX to UART RX (GPIO44) */
/*20240901 Removed full path reference, & reworked applying advance parser corrections */
/*20240902 LVGLMsgBox.cpp - re-instated setStrTxtFlg(bool flg) - mainly to clear F1 Memory */
/*20240903 re-worked keyboard 'delete' key handling */
/*20240904 LVGLMsgBox.cpp - re-worked cursor management, in send test area, to improve outgoing character hilighting */
/*20240924 LVGLMsgBox.cpp - reworked Update_textarea() when 'capping the ta buffer to take in account character width & word breaks*/
/*20240925 locked down espidf version & i2c_master.h updated i2c_device_config_t definition/structure */
/*20241026 Added 'F9' Scope Screen */
/*20241028 Added IIR tracking filter to ADC processing*/
/*20241031 Reworked postparsing replace text process/code*/
/*20241103 added direct Linking of Settings Screen Debug setting to advance parser's Dbug property */
/*20241104 added ScopeActive flag to better syncronize when its OK to update the 'SCOPE' screen*/
/*20241105 added F1 stored memory contents to main screen & Help Screen */
/*20241112 Added 'F8' Day/Night mode per request from Carl (VK5CT)*/
/*20241113 reworked Night mode sig strenght bar color*/
/*20241115 Added Night mode to saved settings*/
/*20241117 added KeyupVarPrcnt AdvParser.cpp, to better recognize keyboard/paddle sent code */
/*20241119 added forced wordbreak based on shift in incoming tone frequency */
/*20241120 AdvParser.cpp- added new sloppy bug letter break test to rule set & changed DitIntrvlVal calc*/
/*20241124 Modified Night mode checkbox color & minor tweaks to AdvParser.cpp ruleset*/
/*20241209 more tweaks to AdvParser.cpp to mainly to improve sloppy bug (B3) fist decoding*/
/*20241212 more tweaks to AdvParser.cpp to improve quick timing set points */
/*20241214 more tweaks to AdvParser.cpp to improve BUG decoding */
/*20241221 Goertzelcpp - added dynamic adjustment/correction to squelch/threshold */
#define USE_KYBrd 1
#include "sdkconfig.h" //added for timer support
#include "globals.h"
#include "main.h"
#if USE_KYBrd
#include "bt_keyboard.h"
#endif /* USE_KYBrd*/
#include <esp_log.h>
#include <iostream>
#include <math.h> // added this for iir support
#include "esp_system.h"
#include "esp_event.h"
#include "driver/gpio.h"
#include "rom/ets_sys.h"
#include "soc/soc_caps.h" // included just to have quick access view this file
///////////////////////////////
#include "esp_core_dump.h"
/*helper ADC files*/
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_adc/adc_continuous.h"
/*Project specific files*/
#include "Goertzel.h"
#include "DcodeCW.h"
#include "LVGLMsgBox.h"
#include "CWSndEngn.h"
/*BlueTooth*/

#include <string.h> // included to support call to 'memset()'
/*Uncomment to plot Raw ADC Samples*/
// #define POSTADC
/* the following defines were taken from "hal/adc_hal.h" 
 and are here for help in finding the true ADC sample rate based on a given declared sample frequency*/
#define ADC_LL_CLKM_DIV_NUM_DEFAULT       15
#define ADC_LL_CLKM_DIV_B_DEFAULT         1
#define ADC_LL_CLKM_DIV_A_DEFAULT         0
#define ADC_LL_DEFAULT_CONV_LIMIT_EN  6    0
//#define TODAY __DATE__

#define TFT_GREY 0x5AEB // New colour

//TFT_eSPI tft = TFT_eSPI(); // Invoke TFT Display library
//////////////////////////////
/*timer interrupt support*/
#include "esp_timer.h"
esp_timer_handle_t DotClk_hndl;
// esp_timer_handle_t DsplTmr_hndl;
TimerHandle_t DisplayTmr;
/* END timer interrupt support          */

/*Debug & backtrace analysis*/
uint8_t global_var;
/*To make these variables available to other files/section of this App, Moved the following to main.h*/

