jmharvey1/ESP32S3_CW_Machine/src/main.cpp
  adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = {0};
  dig_cfg.pattern_num = channel_num;
  for (int i = 0; i < channel_num; i++)
  {
    uint8_t unit = ADC_UNIT_1;
    uint8_t ch = channel[i] & 0x7;
    adc_pattern[i].atten = ADC_ATTEN_DB_12; // ADC_ATTEN_DB_0;
    adc_pattern[i].channel = ch;
    adc_pattern[i].unit = unit;
    adc_pattern[i].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH;

    ESP_LOGI(TAG1, "adc_pattern[%d].atten is :%x", i, adc_pattern[i].atten);
    ESP_LOGI(TAG1, "adc_pattern[%d].channel is :%x", i, adc_pattern[i].channel);
    ESP_LOGI(TAG1, "adc_pattern[%d].unit is :%x", i, adc_pattern[i].unit);
  }
  dig_cfg.adc_pattern = adc_pattern;
  ESP_ERROR_CHECK(adc_continuous_config(handle, &dig_cfg));

  *out_handle = handle;
}
/*commented out for Wavshare version; No other reference to this function found */
// static bool check_valid_data(const adc_digi_output_data_t *data)
// {
//   if (data->type1.channel >= SOC_ADC_CHANNEL_NUM(ADC_UNIT_1))
//   {
//     return false;
//   }
//   return true;
// }
////////////////////////////////////////////
/*Actually handles a number things
* like calculate current frequency of incoming signal
* but originally created to simply pass the current ADC sampler to the goertzel tone detector algorythem 
*/
void addSmpl(int k, int i, int *pCntrA)
{
  /*The following is for diagnostic testing; it generates a psuesdo tone input of known freq & magnitude */
  // dwelCnt++;
  // if (dwelCnt>20*Goertzel_SAMPLE_CNT){ //Inc psuedo tone freq by 5 hz every 20 sample groups; i.e.~ every 80ms
  //   dwelCnt = 0;
  //   synthFreq +=5;
  //   if(synthFreq>950){
  //     synthFreq = 500;
  //   }
  //   AnglInc = 2*PI*synthFreq/SAMPLING_RATE;
  // }
  // LclToneAngle += AnglInc;
  // if(LclToneAngle >= 2*PI) LclToneAngle = LclToneAngle - 2*PI;
  // k = (int)(800*sin(LclToneAngle));

  /*Calculate Tone frequency*/
  /*the following is part of the auto tune process */
  if(!SmplSetDone){
    BiasError += k; 
    Smplcnt++;
    if(Smplcnt == 200000)
    {
      BiasError = BiasError/200000;
      Smplcnt = 0;
      SmplSetDone = true;
    }
  }
  /*IIR manual method */
float decimated = float(k);
float IIRBPOut =
    a0 * decimated
    + a1 * in_z1
    + a2 * in_z2
    - b1 * out_z1
    - b2 * out_z2;
in_z2 = in_z1;
in_z1 = decimated;
out_z2 = out_z1;
out_z1 = IIRBPOut;
decimated = IIRBPOut;
		/*2nd stage */
// IIRBPOut =
// 	a0 * decimated
// 	+ a1 * in_z3
// 	+ a2 * in_z4
// 	- b1 * out_z3
// 	- b2 * out_z4;
// 	in_z4 = in_z3;
// in_z3 = decimated;
// out_z4 = out_z3;
// out_z3 = IIRBPOut;
// decimated = IIRBPOut;
k = (int)decimated;
  const int ToneThrsHld = 100;//100; // minimum usable peak tone value; Anything less is noise
  if (AutoTune)
  {
    /*if we have a usable signal; start counting the number of samples needed capture 40 periods of the incoming tone;
     i.e., a 500Hz tone used to send 2/3 a dah @ 50WPM */
    if ((SmplCNt == 0))
    {
      if (k > ToneThrsHld && Oldk <= ToneThrsHld)
      {
        /*armed with a positive going signal; ready to start new measuremnt; reset counters & wait for it to go negative*/
        TstNegFlg = true;
        NoTnCntr = 0; // set "No Tone Counter" to zero
        PeriodCntr = 0;
        SmplCNt++;
      }
    }
    else
    { // SmplCNt != 0; we're up and counting now
      SmplCNt++;
      NoTnCntr++; // increment "No Tone Counter"
      if (TstNegFlg)
      { // looking for the signal to go negative
        //if ((k < -ToneThrsHld) && (Oldk >= -ToneThrsHld))
        if ((k < -ToneThrsHld))
        {               /*this one just went negative*/
          NoTnCntr = 0; // reset "No Tone Counter" to zero
          TstNegFlg = false;
        }
      }
      else
      { //  TstNegFlg = false ; Now looking for the signal to go positve
        //if ((k > ToneThrsHld) && (Oldk <= ToneThrsHld))
        if ((k > ToneThrsHld))
        {               /* this one just went positive*/
          PeriodCntr++; // we've lived one complete cycle of some unknown frequency
          NoTnCntr = 0; // reset "No Tone Counter" to zero
          TstNegFlg = true;
        }
      }
    }
    if (NoTnCntr == 200 || (PeriodCntr == 40 && (SmplCNt < 3500))) // no higher than 952Hz
    {                                                              /*We processed enough samples; But params are outside a usable frequency; Reset & try again*/
      SmplCNt = 0;
    }
    else if (PeriodCntr == 40)
    {
      /*if here, we have a usable signal; calculate its frequency*/
      DemodFreq = ((int)PeriodCntr * (int)SAMPLING_RATE) / (int)SmplCNt;
      freq_int = DemodFreq;
      if (DemodFreq > 450)
      {
        
        if ((DemodFreq > DmodFrqOld - 2) && (DemodFreq < DmodFrqOld + 2))
        {/*OK we got essentially the same freq twice in row, so it must be valid*/
          if((TARGET_FREQUENCYC - DemodFreq) > 15 || (DemodFreq - TARGET_FREQUENCYC ) > 15 )
          {
            /*if here, we just had a shift in the incoming tone of more than 15hz, 
            so assume new 'sender', & force a wordbreak in the decoded text
            by setting the expected wordbreak time to 0 */
            wordBrk =0;
          }
          DmodFrqOld = (4*TARGET_FREQUENCYC + DemodFreq)/5;
          //sprintf(Title, "Tone: %d\t%d\n", DemodFreq, (int)SmplCNt);
          //printf(Title);
          CalGtxlParamFlg = true;
          Calc_IIR_BPFltrCoef((float)DmodFrqOld, SAMPLING_RATE, 3.7071);
          
        }
        DmodFrqOld = DemodFreq;
      }

      /*reset for next round of samples*/
      SmplCNt = 0;
    }
    Oldk = k;
  }
  if (ScopeFlg)
  {
    if (!SmplSetRdy && !ScopeArm && (k < 50)) //&& (k < ToneThrsHld/2))
      ScopeArm = true;
    if (!SmplSetRdy && ScopeArm && (k > 50))  //&& (k > ToneThrsHld/2)) 
      ScopeTrigr = true;
    if (ScopeTrigr)
    {
      if (ui_Chart1_series_1 != NULL)
        ui_Chart1_series_1->y_points[*pCntrA] = (k / 10);
      *pCntrA += 1;
      if (*pCntrA == 700)
      {
        *pCntrA = 0;
        SmplSetRdy = true;
        ScopeArm = false;
        ScopeTrigr = false;
      }
    }
  }
  ProcessSample(k, i);
/* uncomment for diagnostic testing; graph raw ADC samples*/
#ifdef POSTADC
  if ((*pCntrA < (6 * Goertzel_SAMPLE_CNT)) && UrTurn)
  {
    if ((*pCntrA == Goertzel_SAMPLE_CNT) || (*pCntrA == 2 * Goertzel_SAMPLE_CNT) || (*pCntrA == 3 * Goertzel_SAMPLE_CNT) || (*pCntrA == 4 * Goertzel_SAMPLE_CNT) || (*pCntrA == 5 * Goertzel_SAMPLE_CNT))
    {
      Smpl_buf[*pCntrA] = k; // use this line if marker is NOT needed
      // Smpl_buf[*pCntrA] = 2000+(*pCntrA); // place a marker at the end of each group
    }
    else if (*pCntrA != 0)
      Smpl_buf[*pCntrA] = k;
    *pCntrA += 1;
  }
  if ((*pCntrA == (6 * Goertzel_SAMPLE_CNT)) || !UrTurn)
  {
    UrTurn = false;
    *pCntrA = 0;
    // Smpl_buf[*pCntrA] = 2000; // place a marker at the the begining of the next set
  }
#endif
  /* END code for diagnostic testing; graph raw ADC samples*/
}

/////////////////////////////////////////////
/* Goertzel Task; Process ADC buffer*/
void GoertzelHandler(void *param)
{
  static uint32_t thread_notification;
  static const char *TAG2 = "ADC_Read";
  // uint16_t curclr = 0;
  // uint16_t oldclr = 0;
  int curclr = 0; // modified to support lvgl based display
  int oldclr = 0; // modified to support lvgl based display
  int pksig = 0;
  int k;
  int offset = 0;
  /*for Waveshare/ESP32s3 & based on 11 bit ADC output; Set bias to 1024*/
  int BIAS = 1800; // 1844+150; // based reading found when no signal applied to ESP32Cw_Machine_ADC_init
  int Smpl_CntrA = 0;
  bool FrstPass = true;
  int pksigH = 0;
  int sigSmplCnt = 0;
  // bool updt = false;
  InitGoertzel(); // make sure the Goertzel Params are setup & ready to go
  /*The following is just for time/clock testing/veification */
  // unsigned long GrtzlStart = pdTICKS_TO_MS(xTaskGetTickCount());
  // unsigned long GrtzlDone = pdTICKS_TO_MS(xTaskGetTickCount());
  bool skip1;
  while (1)
  {
    skip1 = false;
    /* Sleep until we are notified of a state change by an
     * interrupt handler. Note the first parameter is pdTRUE,
     * which has the effect of clearing the task's notification
     * value back to 0, making the notification value act like
     * a binary (rather than a counting) semaphore.  */

    thread_notification = ulTaskNotifyTake(pdTRUE,
                                           portMAX_DELAY);

    if (thread_notification)
    { // Goertzel data samples ready for processing
      unsigned long Now = EvntStart; //pdTICKS_TO_MS(xTaskGetTickCount());
      if(SmplSetDone){
        BIAS = BIAS + BiasError;
        bias_int = BIAS;
        //printf("BIAS: %d; error: %f\n", BIAS, BiasError);
        BiasError = 0;
        SmplSetDone = false;
        
