jmharvey1/ESP32S3_CW_Machine/src/main.cpp
          }
        }
         UrTurn = true;
      }
#endif /* POSTADC */     
      /* END code for diagnostic testing; graph ADC samples; */
      
      xTaskNotifyGive(CWDecodeTaskHandle);
      
    }
    else if (ret == ESP_ERR_TIMEOUT)
    {
      ESP_LOGI(TAG3, "BREAK from CWDecodeTask TASK");
      break;
    }
    if(WokeFlg){ //report void IRAM_ATTR DotClk_ISR(void *arg) result
      WokeFlg = false;
      printf("!!WOKE!!\n");
    }
    if(QuequeFulFlg){ //report void IRAM_ATTR DotClk_ISR(void *arg) result
      //QuequeFulFlg = false;
      char buf[40];
      sprintf(buf, "!!state QUEUE FULL!! %d\n", (int)QueFullstate);
      //printf(buf);
    }
  }
}
/*look for 'advertising' BLE keyboards
note: task remains active until one is found & 'paired'('PairFlg' is set to true)*/
void BLE_scan_tsk(void *param)
{
  const char *TAG2 = "BLE_scan_tsk";
  const char *TAG2A = "\nBLE_scan_tsk";
  //esp_log_level_set("*", ESP_LOG_DEBUG);
  /*Used diagnose Advance parser CPU usage*/
  // UBaseType_t uxHighWaterMark;
  // unsigned long AdvPStart = 0;
  bool loop = true;
  SkippDotClkISR = true;
  while (loop)
  {
    bt_keyboard.PairFlg = false;
    ESP_LOGI(TAG2, "BLE SCAN - START");
    uint32_t EvntStart = pdTICKS_TO_MS(xTaskGetTickCount());
    uint16_t dev_scan_intrvl = 0;
    bt_keyboard.devices_scan(2); // Required to discover new keyboards and for pairing
                                 // Default duration is 3 seconds
    //while(dev_scan_intrvl<2000)
    //{
    //  dev_scan_intrvl = (uint16_t)(pdTICKS_TO_MS(xTaskGetTickCount()) - EvntStart);
    //}
    //ESP_LOGI(TAG2, "BLE SCAN - DONE (interval: %d)", dev_scan_intrvl);
    ESP_LOGI(TAG2, "BLE SCAN - DONE\n\n");
    if (bt_keyboard.GetPairFlg1())
    { 
      bt_keyboard.PairFlg = true;
      /*Clear/Erase Keyboard text area*/
      if (!DFault.DeBug)
      {
        Title[0] = 0xFF;
        Title[1] = 0x0;
        lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE); // clear send keyboard text area
      }
      sprintf(Title, "KEYBOARD READY\n");
      lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE);
      ESP_LOGI(TAG2, "Pairing Complete; KEYBOARD READY");
    }
    if (bt_keyboard.PairFlg)
    {
      //printf("EXIT SCAN\n");
      ESP_LOGI(TAG2, "EXIT SCAN");
      loop = false;
      // vTaskSuspend(NULL); // NULL = suspend this task
    }
  } // end while(loop)
  /** JMH Added this to ESP32 version to handle random crashing with error,"Task Goertzel Task should not return, Aborting now" */
  SkippDotClkISR = false;
  vTaskDelete(NULL);
}

///////////////////////////////////////////////////////////////////////////////////
/* AdvParserTask Task; Post Parser Code execution
*  Note: this task runs on core 1 
*/
void AdvParserTask(void *param)
{
  // static uint32_t thread_notification;// not used in AdvParserTask
  /*Used diagnose Advance parser CPU usage*/
  // UBaseType_t uxHighWaterMark;
  // unsigned long AdvPStart = 0;
  while (1)
  {
    /* Sleep until instructed to resume from DcodeCW.cpp */
    // printf("AdvParserTask Launched\n"); //added to verify task management
    /*Used diagnose Advance parser CPU usage*/
    // AdvPStart = pdTICKS_TO_MS(xTaskGetTickCount());
    //if (xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx, portMAX_DELAY) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
    //{
      BlkDcdUpDts = true;
      advparser.EvalTimeData();
      /*Now compare Advparser decoded text to original text; If not the same,
      replace displayed with Advparser version*/
      bool same = true;
      bool Tst4Match = true;
      int i;
      int FmtchPtr; // now only used for debugging
      /*Scan/compare last word displayed w/ advpaser's version*/
      int NuMsgLen = advparser.GetMsgLen();
      int LtrPtr = advparser.LtrPtr;
      wrdbrkFtcr = advparser.wrdbrkFtcr;
      if (NuMsgLen > LtrPtr || NuMsgLen < LtrPtr)
      { // if the advparser test string is longer, then delete the last word printed
        same = false;
        i = LtrPtr;
      }
      else
      {
        for (i = 0; i < LtrPtr; i++)
        {
          if (advparser.Msgbuf[i] == 0)
          {
            Tst4Match = false;
            break;
          }
          if ((advparser.LtrHoldr[i] != advparser.Msgbuf[i]) && Tst4Match)
          {
            FmtchPtr = i; // now only used for debugging
            same = false;
          }
          // if (advparser.LtrHoldr[i] == 0)
          //   break;
        }
      }

      /*If they don't match, replace displayed text with AdvParser's version*/
      int deletCnt = LtrPtr; // 0; // moved to here to support lvgl debugging
      int bufcharcnt = 0;
      char ringbuf[6];
      char spacemarker = 'Y';
      uint8_t LstChr = 0;
      if (!same)
      {
        /*need to block display update task during this 'if()' code */
        if (xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx, portMAX_DELAY) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
        {
        bool oldDltState = dletechar;
        LstChr = lvglmsgbx.GetLastChar();
        if (LstChr == 0x20) // test to see if a word break/space has been applied
        {
          //deletCnt++; // number of characters + space to be deleted
        }
        else if(LstChr == 68)
        {
          spacemarker = '?';
          /*shift the parsed text buffer one charater right, and put a 'space' at the begining*/
          NuMsgLen++;
          advparser.Msgbuf[NuMsgLen + 1] = 0;
          for (int i = NuMsgLen; i > 0; i--)
          {
            advparser.Msgbuf[i] = advparser.Msgbuf[i - 1];
          }
          advparser.Msgbuf[0] = 0x20;
        }
        else
        {
          spacemarker = 'N';
          if (lvglmsgbx.TestRingBufPtrs())
          {
            /*shift the parsed text buffer one charater right, and put a 'space' at the begining*/
            NuMsgLen++;
            advparser.Msgbuf[NuMsgLen + 1] = 0;
            for (int i = NuMsgLen; i > 0; i--)
            {
              advparser.Msgbuf[i] = advparser.Msgbuf[i - 1];
            }
            advparser.Msgbuf[0] = 0x20;
          }
        }
        /*Configure DCodeCW.cpp to erase/delete original text*/
        /*Add word break space to post parsed text*/
        char RingBufTst = 'T';
        /*returns true if the 2 buffer pointers are the same*/
        ringbuf[0] = ringbuf[1]  = ringbuf[2] = ringbuf[3] = 0;
        if (!lvglmsgbx.TestRingBufPtrs())
        {
          bufcharcnt = lvglmsgbx.XferRingbuf(ringbuf);
          RingBufTst = 'F';
        }
        
        advparser.Msgbuf[NuMsgLen] = 0x20; // 0x5f;//0x20;
        advparser.Msgbuf[NuMsgLen + 1] = 0x0;
        char tmpbuf[30];
        int OlddeletCnt = deletCnt;
        if(deletCnt>0)
        {
          /*20241216 new method to find final/actual delete count*/
          if (LstChr != 32)
          { // don't apply any correction, if a 'space'(32) was found as the last character printed to the display
            int charCnt = strlen(advparser.LtrHoldr);
            int ptr = 0;
            while (deletCnt > 0 && (charCnt - ptr > 0))
            {
              if (advparser.LtrHoldr[charCnt - ptr] == LstChr)
                break;
              deletCnt--;
              ptr++;
            }
            if (OlddeletCnt > deletCnt)
              deletCnt++;
          }
          /*End new find delete count method*/
          char DelStr[30];
          if(deletCnt>29)
          {
            deletCnt = 29;
            printf("\n deletCnt capped @ 29\n");
          }
          for(int i = 0; i < deletCnt; i++)
          {
            DelStr[i] = 0x8;
          }
          DelStr[deletCnt] = 0x0;
          /*Now copy the new advparser character string/set to a temp buffer 'tmpbuf'*/
          //char tmpbuf[30];
          int ptr = 0;
          while(advparser.Msgbuf[ptr] !=0 && ptr <28)
          {
            tmpbuf[ptr] = advparser.Msgbuf[ptr];
            ptr++;
          }
          tmpbuf[ptr] = 0;
          /*reassemble 'Msgbuf' with new adparser character set prefixed with the number of deletes
           needed to remove the original text*/
          sprintf(advparser.Msgbuf,"%s%s", DelStr, tmpbuf);
          /*for test/debug, show/print the before & after results*/
          //printf("old txt:%s;  new txt:%s\n\tdelete cnt: %d; advparser.LtrPtr %d; new txt length: %d; RingBufTst=%c; bufcharcnt: %d; ringbuf: %c%s%c; Space Corrected = %c(%d/%c%c%C) \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, ptr, RingBufTst, bufcharcnt, '"', ringbuf, '"', spacemarker, LstChr, '"', LstChr, '"');
        }
        
