jmharvey1/ESP32S3_CW_Machine/src/main.cpp
  /* The timer has been created but is not running yet */
//intr_matrix_set(xPortGetCoreID(), ETS_TG0_T1_LEVEL_INTR_SOURCE, 26); // ESP32
intr_matrix_set(xPortGetCoreID(), XCHAL_TIMER1_INTERRUPT, 26);// ESP32S3 added this entry/setting for waveshare display dev baord
 ESP_INTR_ENABLE(26); // display

 // To test the Pairing code entry, uncomment the following line as pairing info is
  // kept in the nvs. Pairing will then be required on every boot.
  // ret = nvs_flash_init();
  // ESP_ERROR_CHECK(nvs_flash_erase());
  ret = nvs_flash_init();
  if ((ret == ESP_ERR_NVS_NO_FREE_PAGES) || (ret == ESP_ERR_NVS_NEW_VERSION_FOUND))
  {
    ESP_ERROR_CHECK(nvs_flash_erase());
    ret = nvs_flash_init();
  }
  ESP_ERROR_CHECK(ret);

  /*Initialize display and load splash screen*/
  lvglmsgbx.InitDsplay();
  // sprintf(Title, " ESP32s3 CW Machine (%s)\n", RevDate); // sprintf(Title, "CPU CORE: %d\n", (int)xPortGetCoreID());
  // lvglmsgbx.dispDeCdrTxt(Title, TFT_SKYBLUE);

  /* test/check NVS to see if user setting/param have been stored */
  uint8_t Rstat = Read_NVS_Str("MyCall", DFault.MyCall);
  if (Rstat != 1)
  {
    /*No settings found; load factory settings*/
    sprintf(DFault.MyCall, "%s", MyCall);
    sprintf(DFault.MemF2, "%s", MemF2);
    sprintf(DFault.MemF3, "%s", MemF3);
    sprintf(DFault.MemF4, "%s", MemF4);
    sprintf(DFault.MemF5, "%s", MemF5);
    DFault.DeBug = DeBug;
    DFault.NiteMode = NiteMode;
    DFault.WPM = CWsndengn.GetWPM();
    DFault.ModeCnt = ModeCnt;
    DFault.AutoTune = AutoTune;
    DFault.TRGT_FREQ = (int)TARGET_FREQUENCYC;
    DFault.Grtzl_Gain = Grtzl_Gain;
    DFault.SlwFlg = SlwFlg;
    DFault.NoisFlg = NoisFlg;
    
    sprintf(Title, "\n        No stored USER params Found\n   Using FACTORY values until params are\n   'Saved' via the Settings Screen\n");
    lvglmsgbx.dispDeCdrTxt(Title, TFT_ORANGE);
  #if USE_KYBrd
  bt_keyboard.trapFlg = false;
  #endif /* USE_KYBrd*/
  }
  else
  {
    /*found 'mycall' stored setting, go get the other user settings */
    int strdAT;
    Rstat = Read_NVS_Str("MemF2", DFault.MemF2);
    Rstat = Read_NVS_Str("MemF3", DFault.MemF3);
    Rstat = Read_NVS_Str("MemF4", DFault.MemF4);
    Rstat = Read_NVS_Str("MemF5", DFault.MemF5);
    Rstat = Read_NVS_Val("DeBug", DFault.DeBug);
    Rstat = Read_NVS_Val("NiteMode", strdAT);
    DFault.NiteMode = (bool)strdAT;
    NiteMode = DFault.NiteMode;
    Rstat = Read_NVS_Val("WPM", DFault.WPM);
    Rstat = Read_NVS_Val("ModeCnt", DFault.ModeCnt);
    Rstat = Read_NVS_Val("TRGT_FREQ", DFault.TRGT_FREQ);
    int intGainVal; // uint64_t intGainVal;
    Rstat = Read_NVS_Val("Grtzl_Gain", intGainVal);
    DFault.Grtzl_Gain = (float)intGainVal / 10000000.0;
    Rstat = Read_NVS_Val("AutoTune", strdAT);
    DFault.AutoTune = (bool)strdAT;
    Rstat = Read_NVS_Val("SlwFlg", strdAT);
    DFault.SlwFlg = (bool)strdAT;
    Rstat = Read_NVS_Val("NoisFlg", strdAT);
    DFault.NoisFlg = (bool)strdAT;
    /*pass the decoder se vTaskDelay(5000 / portTICK_PERIOD_MS);tting(s) back to their global counterpart(s) */
    AutoTune = DFault.AutoTune;
    SlwFlg = DFault.SlwFlg;
    NoisFlg = DFault.NoisFlg;
    NiteMode = DFault.NiteMode;
    ModeCnt = DFault.ModeCnt;
    DeBug = DFault.DeBug;
    TARGET_FREQUENCYC = (float)DFault.TRGT_FREQ;
    Grtzl_Gain = DFault.Grtzl_Gain;
  }
  lvglmsgbx.FlipDayNiteMode(); //set display to light or dark mode based on stored Dfault setting
  /* Start the Display timer */
  xTimerStart(DisplayTmr, portMAX_DELAY);
  vTaskResume( DsplUpDtTaskHandle);
  
  InitGoertzel();
  /*This delay is just to give time for an external USB serrial monitor to get up and running*/
  // vTaskDelay(5000 / portTICK_PERIOD_MS);
 
    #if USE_KYBrd
  bt_keyboard.inPrgsFlg = false;
  if(DFault.DeBug)
  {
    vTaskDelay(pdMS_TO_TICKS(500));
    printf("\n");
  }  
  /*start bluetooth pairing/linking process*/
    if (bt_keyboard.setup(pairing_handler, &bt_keyboard )) // Must be called once
  { 
    /*Start BLE Scan */ 
    xTaskCreatePinnedToCore(BLE_scan_tsk, "BLE Scan Task", 8192, NULL, 1, &BLEscanTask_hndl, 0);
  }
  else
  {
    printf("bt_keyboard.setup(pairing_handler) FAILED!!\n");
    printf("!!PROGRAM HALTED!!\n");
    sprintf(Title, "\n*******  RESTART!  ******\n** NO KEYBOARD PAIRED ***");
    lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
    while (true)
    {
      /*do nothiing*/
      vTaskDelay(pdMS_TO_TICKS(20));
    }
  }
  /*create a scan task for reconnect*/
  // xTaskCreatePinnedToCore(BLE_scan_tsk, "BLE Scan Task", 8192, NULL, 1, &BLEscanTask_hndl, 0);
  // vTaskSuspend( BLEscanTask_hndl);
  #endif /* USE_KYBrd*/
  /*initialize & start continuous DMA ADC conversion process*/
  Cw_Machine_ADC_init(channel, sizeof(channel) / sizeof(adc_channel_t), &adc_handle);
  
  adc_continuous_evt_cbs_t cbs = {
      .on_conv_done = s_conv_done_cb,
  };
  ESP_ERROR_CHECK(adc_continuous_register_event_callbacks(adc_handle, &cbs, NULL));
  ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
  adcON = true;
  xTaskNotifyGive(CWDecodeTaskHandle);
  vTaskDelay(200 / portTICK_PERIOD_MS);
  
  ESP_LOGI(TAG, "Start DotClk interrupt Config");
  //ESP_ERROR_CHECK(esp_intr_alloc(ETS_TG0_T1_LEVEL_INTR_SOURCE, ESP_INTR_FLAG_LEVEL3, DotClk_ISR, DotClk_args.arg, NULL));
  ESP_ERROR_CHECK(esp_intr_alloc(XCHAL_TIMER1_INTERRUPT, ESP_INTR_FLAG_LEVEL3, DotClk_ISR, DotClk_args.arg, NULL));// ESP32S3 added this entry/setting for waveshare display dev baord
  ESP_LOGI(TAG, "End DotClk interrupt Config"); 
 /* Start the timer dotclock (timer)*/
  ESP_ERROR_CHECK(esp_timer_start_periodic(DotClk_hndl, 60000)); // 20WPM or 60ms
  CWsndengn.RfrshSpd = true;
  CWsndengn.ShwWPM(DFault.WPM); // calling this method does NOT recalc/set the dotclock & show the WPM
  CWsndengn.SetWPM(DFault.WPM); // 20230507 Added this seperate method call after changing how the dot clocktiming gets updated
  CWsndengn.UpDtWPM = true;
  
  /* main CW keyboard loop*/
  while (true)
  {
#if 1 // 0 = scan codes retrieval, 1 = augmented ASCII retrieval
    /* note: this loop only completes when there is a key entery from a paired/connected Bluetooth Keyboard */

    vTaskDelay(pdMS_TO_TICKS(10)); // give the watchdogtimer a chance to reset
    // printf("main loop\n");
    if (setupFlg)
    {
      // printf("setupFlg: 'true'\n");
      /*if true, exit main loop and jump to "settings" screen */
      bool IntSOTstate = CWsndengn.GetSOTflg();
      if (IntSOTstate)
        CWsndengn.SOTmode();    // do this to stop any outgoing txt that might currently be in progress before switching over to settings screen
      lvglmsgbx.SaveSettings(); // save keyboard app's current display configuration; i.e., ringbuffer pointeres, etc. So that when the user closes the setting screen the keyboard app can conitnue fro where it left off
      /* if in decode mode 4, the adc DMA scan was never started*/
      if (ModeCnt != 4)
      {
        ESP_ERROR_CHECK(adc_continuous_stop(adc_handle)); // true; user has pressed Ctl+S key, & wants to configure default settings
        adcON = false;
        printf("setupFlg = true\n");
        vTaskSuspend(GoertzelTaskHandle);
        ESP_LOGI(TAG1, "SUSPEND GoertzelHandler TASK");
        vTaskSuspend(CWDecodeTaskHandle);
        ESP_LOGI(TAG1, "SUSPEND CWDecodeTaskHandle TASK");
        // vTaskSuspend(DsplUpDtTaskHandle);
        // ESP_LOGI(TAG1, "SUSPEND DsplUpDtTaskHandle TASK");
        vTaskDelay(20);
      }
      /*Now ready to jump to "settings" screen */
      lvglmsgbx.BldSettingScreen();
      // ESP_LOGI(TAG1, "RESUME DsplUpDtTaskHandle TASK");
      // vTaskResume(DsplUpDtTaskHandle); 
      SettingsLoop(); // go here while settings screen is active
      advparser.Dbug = (bool)DFault.DeBug;
      if (DFault.NiteMode != NiteMode) lvglmsgbx.FlipDayNiteMode();;
      // else printf("advparser.Dbug OFF\n");
      CWsndengn.RefreshWPM();
      if (IntSOTstate && !CWsndengn.GetSOTflg())
        CWsndengn.SOTmode(); // Send On Type was enabled when we went to 'settings' so re-enable it
      if (ModeCnt != 4)
      {
        // Cw_Machine_ADC_init(channel, sizeof(channel) / sizeof(adc_channel_t), &adc_handle);
        // ESP_ERROR_CHECK(adc_continuous_register_event_callbacks(adc_handle, &cbs, NULL));
        ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
        adcON = true;
        ESP_LOGI(TAG1, "RESUME CWDecodeTaskHandle TASK");
        vTaskResume(CWDecodeTaskHandle);
        ESP_LOGI(TAG1, "RESUME GoertzelHandler TASK");
        vTaskResume(GoertzelTaskHandle);
        vTaskDelay(20);
      }
    }
    if (ScopeFlg)
    {
      bool IntSOTstate = CWsndengn.GetSOTflg();
      if (IntSOTstate)
        CWsndengn.SOTmode();    // do this to stop any outgoing txt that might currently be in progress before switching over to settings screen
      lvglmsgbx.SaveSettings(); // save keyboard app's current display configuration; i.e., ringbuffer pointeres, etc. So that when the user closes the setting screen the keyboard app can conitnue fro where it left off
      /*Now ready to jump to "Scope" screen */
      lvglmsgbx.BldScopeScreen();
      ScopeLoop(); // go here while Scope screen is active
      CWsndengn.RefreshWPM();
      if (IntSOTstate && !CWsndengn.GetSOTflg())
        CWsndengn.SOTmode(); // Send On Type was enabled when we went to 'settings' so re-enable it
    }
    if (HelpFlg)
    {
      bool IntSOTstate = CWsndengn.GetSOTflg();
      if (IntSOTstate)
        CWsndengn.SOTmode();    // do this to stop any outgoing txt that might currently be in progress before switching over to settings screen
      lvglmsgbx.SaveSettings(); // save keyboard app's current display configuration; i.e., ringbuffer pointeres, etc. So that when the user closes the setting screen the keyboard app can conitnue fro where it left off
      /*Now ready to jump to "Scope" screen */
      lvglmsgbx.BldHelpScreen();
      HelpLoop(); // go here while Scope screen is active
      CWsndengn.RefreshWPM();
      if (IntSOTstate && !CWsndengn.GetSOTflg())
        CWsndengn.SOTmode(); // Send On Type was enabled when we went to 'settings' so re-enable it
    }

    /*Added this to support 'open' paired BT keyboard event*/

    switch (bt_keyboard.Adc_Sw)
    {
    case 1: // need to shut down all other spi activities, so the pending BT event has exclusive access to SPI
      bt_keyboard.Adc_Sw = 0;
      if (adcON && !CWsndengn.GetSOTflg()) // added "if" just to make sure we're not gonna do something that doesn't need doing
      {
        ESP_LOGI(TAG1, "!!!adc_continuous_stop!!!");
        printf("CASE 2\n");
        ESP_ERROR_CHECK(adc_continuous_stop(adc_handle));
        adcON = false;
        vTaskSuspend(GoertzelTaskHandle);
        ESP_LOGI(TAG1, "SUSPEND GoertzelHandler TASK");
        vTaskSuspend(CWDecodeTaskHandle);
        ESP_LOGI(TAG1, "SUSPEND CWDecodeTaskHandle TASK");
      }
      break;

    case 2: // BT event complete restore/resume all other spi activities
      bt_keyboard.Adc_Sw = 0;
      if (!adcON) // added "if" just to make sure we're not gonna do something that doesn't need doing
      {
        ESP_LOGI(TAG1, "***adc_continuous_start***");
        ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
        adcON = true;
        ESP_LOGI(TAG1, "RESUME CWDecodeTaskHandle TASK");
        vTaskResume(CWDecodeTaskHandle);
        ESP_LOGI(TAG1, "RESUME GoertzelHandler TASK");
        vTaskResume(GoertzelTaskHandle);
        if (bt_keyboard.PairFlg && bt_keyboard.inPrgsFlg)
        {
          xTimerStart(DisplayTmr, portMAX_DELAY);
          // vTaskResume(DsplUpDtTaskHandle);
          bt_keyboard.PairFlg = false;
          bt_keyboard.inPrgsFlg = false;
          Title[0] = 0xFF;
          Title[0] = 0x0;
          lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE);
          ESP_LOGI(TAG2, "Pairing Complete; Display ON");
        }
      }
      break;

    default:
      break;
    } // end switch
    if (bt_keyboard.PairFlg && !bt_keyboard.inPrgsFlg)
    {
      xTimerStop(DisplayTmr, portMAX_DELAY);
      ESP_LOGI(TAG2, "Pairing Start; Display OFF");
      bt_keyboard.inPrgsFlg = true;
    }
    uint8_t key = 0;
    if (0) // set to '1' for flag debugging
    {
      if (bt_keyboard.OpnEvntFlg)
        printf("OpnEvntFlgTRUE");
      else
        printf("OpnEvntFlgFALSE");
      if (bt_keyboard.trapFlg)
        printf("; trapFlgTRUE\n");
      else
        printf("; trapFlgFALSE\n");

      // else
      //   printf("; PairFlgFALSE\n");
    }
    if (bt_keyboard.OpnEvntFlg && !bt_keyboard.trapFlg) // this gets set to true when the K380 KB generates corrupt keystroke data
      key = bt_keyboard.wait_for_ascii_char(false);     // true  // by setting to "true" this task/loop will wait 'forever' for a keyboard key press

    /*test key entry & process as needed*/
    if (key != 0)
    {
      ProcsKeyEntry(key);
    }

#else
#if USE_KYBrd
    BTKeyboard::KeyInfo inf;

    bt_keyboard.wait_for_low_event(inf);

    printf("RECEIVED KEYBOARD EVENT - Mod: %#X,  Keys: %#X, %#X, %#X \n", (uint8_t)inf.modifier, inf.keys[0], inf.keys[1], inf.keys[2]);
    // std::cout << "RECEIVED KEYBOARD EVENT: "
    //           << std::hex
    //           << "Mod: "
    //           << +(uint8_t)inf.modifier
    //           << ", Keys: "
    //           << +inf.keys[0] << ", "
    //           << +inf.keys[1] << ", "
    //           << +inf.keys[2] << std::endl;
#endif /* USE_KYBrd*/
#endif /* if(1||0)*/
  } /*End while loop*/
} /*End Main loop*/

